# Base de datos

## Importando m√≥dulos

In [1]:
from sqlalchemy import create_engine
import psycopg2
import pandas as pd
import requests

## Conexion

In [2]:
def getPostgreConnector(stringConnection= 'postgresql+psycopg2://postgres:postgres@db-test.cq4syw9xqygb.us-east-1.rds.amazonaws.com:5432/postgres'):
    engine = create_engine(stringConnection)
    return engine

In [3]:
engine = getPostgreConnector()
with engine.connect() as connection:
    result = connection.execute('Select version()')
    print(result.fetchone())

('PostgreSQL 12.5 on x86_64-pc-linux-gnu, compiled by gcc (GCC) 4.8.5 20150623 (Red Hat 4.8.5-11), 64-bit',)

## Creando tablas

In [4]:
with engine.connect() as connection:
    connection.execute(""" CREATE TABLE product_groups_erick (
                                                    group_id serial PRIMARY KEY,
                                                    group_name VARCHAR (255) NOT NULL,
                                                    stock INT NOT NULL
                                                    );""")
    connection.execute(""" CREATE TABLE products_erick (
                                                    product_id serial PRIMARY KEY,
                                                    product_name VARCHAR (255) NOT NULL,
                                                    price DECIMAL (11, 2),
                                                    group_id INT NOT NULL,
                                                    FOREIGN KEY (group_id) REFERENCES product_groups_erick (group_id)
                                                  );""")

## Poblando DB

In [5]:
query_insert_product_group = """
                                INSERT INTO product_groups_erick (group_name, stock)
                                VALUES
                                  ('Smartphone', 4),
                                  ('Laptop', 4),
                                  ('Tablet', 3);
                             """
query_insert_products = """
                            INSERT INTO products_erick (product_name, group_id,price)
                            VALUES
                              ('Microsoft Lumia', 1, 200),
                              ('HTC One', 1, 400),
                              ('Nexus', 1, 500),
                              ('iPhone', 1, 900),
                              ('HP Elite', 2, 1200),
                              ('Lenovo Thinkpad', 2, 700),
                              ('Sony VAIO', 2, 700),
                              ('Dell Vostro', 2, 800),
                              ('iPad', 3, 700),
                              ('Kindle Fire', 3, 150),
                              ('Samsung Galaxy Tab', 3, 200);
                        """

In [6]:
with engine.connect() as connection:
    connection.execute(query_insert_product_group)
    connection.execute(query_insert_products)

## Reading

In [8]:
with engine.connect() as connection:
    result_groups = connection.execute('SELECT * FROM product_groups_erick')
    print(result_groups.fetchall())
    result_products = connection.execute('SELECT * FROM products_erick')
    print(result_products.fetchall())

[(1, 'Smartphone', 4), (2, 'Laptop', 4), (3, 'Tablet', 3)]
[(1, 'Microsoft Lumia', Decimal('200.00'), 1), (2, 'HTC One', Decimal('400.00'), 1), (3, 'Nexus', Decimal('500.00'), 1), (4, 'iPhone', Decimal('900.00'), 1), (5, 'HP Elite', Decimal('1200.00'), 2), (6, 'Lenovo Thinkpad', Decimal('700.00'), 2), (7, 'Sony VAIO', Decimal('700.00'), 2), (8, 'Dell Vostro', Decimal('800.00'), 2), (9, 'iPad', Decimal('700.00'), 3), (10, 'Kindle Fire', Decimal('150.00'), 3), (11, 'Samsung Galaxy Tab', Decimal('200.00'), 3)]

## Windows Functions

In [12]:
query = """
        SELECT
          group_name,
          AVG (price)
        FROM
          products_erick
        INNER JOIN product_groups_erick USING (group_id)
        GROUP BY
          group_name;
        """

In [10]:
pd.read_sql(sql= query, con= engine, index_col=None)

   group_name    avg
0  Smartphone  500.0
1      Tablet  350.0
2      Laptop  850.0

In [13]:
query = """ 
        SELECT
        product_name,
        price,
        group_name,
        AVG (price) OVER (
          PARTITION BY group_name
        ) as group_average_price
        FROM products_erick
        INNER JOIN product_groups_erick USING (group_id);
      """
pd.read_sql(sql= query, con= engine, index_col=None)

          product_name   price  group_name  group_average_price
0             HP Elite  1200.0      Laptop                850.0
1      Lenovo Thinkpad   700.0      Laptop                850.0
2            Sony VAIO   700.0      Laptop                850.0
3          Dell Vostro   800.0      Laptop                850.0
4      Microsoft Lumia   200.0  Smartphone                500.0
5              HTC One   400.0  Smartphone                500.0
6                Nexus   500.0  Smartphone                500.0
7               iPhone   900.0  Smartphone                500.0
8                 iPad   700.0      Tablet                350.0
9          Kindle Fire   150.0      Tablet                350.0
10  Samsung Galaxy Tab   200.0      Tablet                350.0

## DenseRank

## Ejercicio

Ejecutar query en motor de postgre sobre las tablas products y product_groups para obtener obtener el producto de precio m√°ximo de cada grupo.

In [15]:
query = """ 
        SELECT 
          product_name,
          price,
          group_name
          FROM
            (   SELECT
                product_name,
                price,
                group_name,
                MAX (price) OVER (
                  PARTITION BY group_name
                ) as group_MAX_price
                FROM products
                INNER JOIN product_groups USING (group_id)
            ) as products_with_max
          WHERE group_MAX_price = price
      """
pd.read_sql(sql= query, con= engine, index_col=None)

  product_name   price  group_name
0     HP Elite  1200.0      Laptop
1       iPhone   900.0  Smartphone
2         iPad   700.0      Tablet

In [16]:
query = """ 
        SELECT
        product_name,
        price,
        group_name,
        MIN (price) OVER (
          PARTITION BY group_name
        ) as min_price_in_group,
        MAX (price) OVER (
          PARTITION BY group_name
        ) as max_price_in_group
        FROM products
        INNER JOIN product_groups USING (group_id);
      """
pd.read_sql(sql= query, con= engine, index_col=None)

,product_name,price,group_name,min_price_in_group,max_price_in_group
0,HP Elite,1200.0,Laptop,700.0,1200.0
1,Lenovo Thinkpad,700.0,Laptop,700.0,1200.0
2,Sony VAIO,700.0,Laptop,700.0,1200.0
3,Dell Vostro,800.0,Laptop,700.0,1200.0
4,Microsoft Lumia,200.0,Smartphone,200.0,900.0
5,HTC One,400.0,Smartphone,200.0,900.0
6,Nexus,500.0,Smartphone,200.0,900.0
7,iPhone,900.0,Smartphone,200.0,900.0
8,iPad,700.0,Tablet,150.0,700.0
9,Kindle Fire,150.0,Tablet,150.0,700.0
10,Samsung Galaxy Tab,200.0,Tablet,150.0,700.0

## Drop tables

In [ ]:
with engine.connect() as connection:
    connection.execute("""drop table if exists product_groups_erick""")